In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

1.4.4

Series create,manipulate,querry,delete

In [4]:
#creating a series from a list
arr=[0,1,2,3,4]
s1=pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [5]:
import numpy as np
n=np.random.randn(5) #create a random Ndarray
index=['a','b','c','d','e']
s2=pd.Series(n,index=index)
s2

a    0.726643
b   -0.691372
c   -0.777859
d    0.896205
e    0.476865
dtype: float64

In [6]:
#create series form  dictionary
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
#slicing
a=s1[:3]
a

0    0
1    1
2    2
dtype: int64

In [8]:
s4=s1.append(s3)
s4

C:\Users\Krishnaraj\AppData\Local\Temp\ipykernel_22712\723408304.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s4=s1.append(s3)

0    0
1    1
2    2
3    3
4    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
s4.drop('e')

0    0
1    1
2    2
3    3
4    4
a    1
b    2
c    3
d    4
dtype: int64

Series Operations

In [10]:
arr1=[0,1,2,3,4,5,7]
arr2=[6,7,8,9,5]

In [11]:
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [12]:
s6=pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [13]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [14]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [15]:
s5.mul(s6)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [16]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [17]:
s6.median()

3.0

In [18]:
print('median',s6.median())
print('max',s6.max())
print('min',s6.min())

median 3.0
max 7
min 0

Create Dataframe

In [19]:
dates=pd.date_range('today',periods=6) #Define time sequence as index
dates

DatetimeIndex(['2023-01-31 22:14:04.517533', '2023-02-01 22:14:04.517533',
               '2023-02-02 22:14:04.517533', '2023-02-03 22:14:04.517533',
               '2023-02-04 22:14:04.517533', '2023-02-05 22:14:04.517533'],
              dtype='datetime64[ns]', freq='D')

In [20]:
dates=pd.date_range('today',periods=6) #Define time sequence as index
num_arr=np.random.randn(6,4) #import numpy random array
num_arr

array([[ 0.04187381,  2.08842168,  1.31050909, -0.29984317],
       [-0.02263454, -0.05641207, -0.76227515,  2.88222539],
       [ 0.08799286,  0.96736367, -0.30862856, -0.23455221],
       [ 0.02365841, -3.33718124,  0.22306789, -1.1520903 ],
       [-0.45455112, -0.39103515, -0.58757049, -0.62016662],
       [-0.68350825,  0.03920533, -1.00314467, -1.03220631]])

In [21]:
dates=pd.date_range('today',periods=6) #Define time sequence as index
num_arr=np.random.randn(6,4) #import numpy random array
columns=['A','B','C','D'] #Use the table as the column name
df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                   A         B         C         D
2023-01-31 22:14:05.835315 -1.790841  0.812624 -1.052286 -0.600175
2023-02-01 22:14:05.835315 -0.408464 -0.182942  0.823925  0.304531
2023-02-02 22:14:05.835315 -1.928881 -0.414975  0.602208 -1.252191
2023-02-03 22:14:05.835315 -0.328314 -0.386854 -0.239567 -0.832217
2023-02-04 22:14:05.835315  0.401027 -1.828420 -0.770822  0.657642
2023-02-05 22:14:05.835315 -0.972088  1.402028  0.429446 -0.443332

In [34]:
#create dataframe with dictionary array
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df2 = pd.DataFrame(exam_data , index=labels)
print(df2)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [35]:
#see datatypes of array
df2.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [36]:
df2.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [37]:
df3=df2.head(6)
df3

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes

In [38]:
df2.tail(3)

    name  score  attempts qualify
h  Laura    NaN         1      no
i  Kevin    8.0         2      no
j  Jonas   19.0         1     yes

In [39]:
df2.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [40]:
df2.index
df2.columns

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

In [41]:
df2.values

array([['Anastasia', 12.5, 1, 'yes'],
       ['Dima', 9.0, 3, 'no'],
       ['Katherine', 16.5, 2, 'yes'],
       ['James', nan, 3, 'no'],
       ['Emily', 9.0, 2, 'no'],
       ['Michael', 20.0, 3, 'yes'],
       ['Matthew', 14.5, 1, 'yes'],
       ['Laura', nan, 1, 'no'],
       ['Kevin', 8.0, 2, 'no'],
       ['Jonas', 19.0, 1, 'yes']], dtype=object)

In [42]:
df2.describe()   #see statistical data of dataframe

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

In [43]:
df2.T

,a,b,c,d,e,f,g,h,i,j
name,Anastasia,Dima,Katherine,James,Emily,Michael,Matthew,Laura,Kevin,Jonas
score,12.5,9.0,16.5,NaN,9.0,20.0,14.5,NaN,8.0,19.0
attempts,1,3,2,3,2,3,1,1,2,1
qualify,yes,no,yes,no,no,yes,yes,no,no,yes

In [51]:
df2.sort_values(by='score')

        name  score  attempts qualify
i      Kevin    8.0         2      no
b       Dima    9.0         3      no
e      Emily    9.0         2      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes
d      James    NaN         3      no
h      Laura    NaN         1      no

In [47]:
#slicing dataframe
df2[1:3]

        name  score  attempts qualify
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [52]:
df2.sort_values(by='score')[1:3]

    name  score  attempts qualify
b   Dima    9.0         3      no
e  Emily    9.0         2      no

In [53]:
#query dataframe by tag
df2[['score','attempts']]

   score  attempts
a   12.5         1
b    9.0         3
c   16.5         2
d    NaN         3
e    9.0         2
f   20.0         3
g   14.5         1
h    NaN         1
i    8.0         2
j   19.0         1

In [54]:
df2.iloc[1:3]  #Query rows 2,3

        name  score  attempts qualify
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [55]:
df3=df2.copy()
df3

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [56]:
df3.isnull()

    name  score  attempts  qualify
a  False  False     False    False
b  False  False     False    False
c  False  False     False    False
d  False   True     False    False
e  False  False     False    False
f  False  False     False    False
g  False  False     False    False
h  False   True     False    False
i  False  False     False    False
j  False  False     False    False

In [57]:
df3.loc['f','score']=1.5
df3

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael    1.5         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [58]:
df3.mean()

C:\Users\Krishnaraj\AppData\Local\Temp\ipykernel_22712\3891983329.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.mean()

score       11.25
attempts     1.90
dtype: float64

In [59]:
df3.sum()

name        AnastasiaDimaKatherineJamesEmilyMichaelMatthew...
score                                                    90.0
attempts                                                   19
qualify                             yesnoyesnonoyesyesnonoyes
dtype: object

In [60]:
string=pd.Series(['A','C','D','Aaa','Bbb','Ccc',np.nan,'CBA','cow','owl'])
string.str.lower()

0      a
1      c
2      d
3    aaa
4    bbb
5    ccc
6    NaN
7    cba
8    cow
9    owl
dtype: object